### numpy.sort()
### .mean() 평균 .median()
### percentie(x, 50) 백분위 수
### random(). np.random.seed(0). np.random.seed(0). np.random.shuffle()
### np.random.choice(a, size=None, replace=True, p=None)
### rand:0 부터 1사이의 균일 분포. randn: 표준 정규 분포. randint
### randint(low, high, size)

## panda:panel datas
## 대부분의 데이터는 시계열(series)이나 표(table)의 형태로 나타냄. pandas 패키지는 이러한 데이터를 다루기 위한 series클래스와 dataframe 클래스를 제공한다.
## 숫자 테이블과 시계열을 조작하기 위한 데이터 구조와 연산을 제공
## import pandas as pd

series 클래스는 numpy에서 제고하는 1차원 배열과 모양이 비슷함. 하지만 series class는 배열과 다르게 각 데이터의 의미를 표시하는 index를 붙일 수 있따. 데이터 자체는 값(value)라고 한다.

In [5]:
import pandas as pd
series = pd.Series(["하나", "둘", "셋", "넷"],
                   index = [_ for _ in range(1, 5)])
series

1    하나
2     둘
3     셋
4     넷
dtype: object

series 객체를 만들 때 첫 인수로 data, 두번째 인수로 index를 넣는다. data값으로는 iterable, 배열, scalar value, dict(key와 index를 동일하게 사용하거나 생략)를 사용할 수 있다.
index는 label이라고도 한다. index는 data와 length가 동일해야 한다. label은 꼭 유일(unique)할 필요는 없다. 다만 반드시 hashable type만 사용 가능. 만약 index를 생략하면 RangeIndex(0, 1, ..., n)를 제공

class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

In [6]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯", "여섯", "일곱", "여덟", "아홉", "열"], 
                   index = [_ for _ in range(1, 11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [9]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_446_052], # 언더스코어는 끊어읽기 편하려고. 쉼표 역할
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2446052
dtype: int64

In [11]:
pd.Series(range(10, 14)) # index없으면 0부터 차례대로

0    10
1    11
2    12
3    13
dtype: int64

In [12]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [13]:
s.values

array([9904312, 3448737, 2890451, 2446052], dtype=int64)

In [41]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2446052
Name: 인구, dtype: int64

In [42]:
d = {'a':1, 'b':2, 'c':3} # dictionary
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

### dict의 key와 series객체의 index를 다르게 설정하면

In [43]:
d = {'a':1, 'b':2, 'c':3} # dictionary
ser = pd.Series(data=d, index=['x', 'y', 'z'])
ser
# NaN 값은 float 자료형에서만 표현 가능하므로 결과가 float 자료형이 되었다.

x   NaN
y   NaN
z   NaN
dtype: float64

index 지정 없이 dict 객체만 가지고 series를 만들 수도 있따. dict의 key가 index로 사용 됨

In [44]:
s2 = pd.Series({'서울':9_904_312,
                '부산':3_448_737,
               '인천':2_890_451,
               '대구':2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [45]:
d = {'a':1, 'b':2, 'c':3} # dictionary
ser = pd.Series(data=d, index=['a', 'b', 'c'])

ser.a, ser.b, ser.c
# 만약 label 값이 영문 문자열인 경우에는 index label이 속성인 것처럼 마침표(.)를 활용하여 해당 index값에 접근 가능

(1, 2, 3)

In [46]:
"서울" in s

True

In [47]:
"대전" in s

False

In [48]:
for k, v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2446052

### series 연산하기
### numpy 배열처럼 Series도 벡터화 연산 가능. 단 연산은 Seires의 value에만 적용되며 index값은 변하지 않음

In [36]:
s/1_000_000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.446052
Name: 인구, dtype: float64

### series 인덱싱
### series는 넘파이 배열에서 가능한 index 방법 외에도 index_label(문자)을 이용한 인덱싱도 가능

In [37]:
s[1], s["부산"]

(3448737, 3448737)

In [38]:
s[3], s["대구"]

(2446052, 2446052)

In [51]:
s[[0, 3, 1]] # 인덱스

도시
서울    9904312
대구    2446052
부산    3448737
Name: 인구, dtype: int64

In [50]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2446052
부산    3448737
Name: 인구, dtype: int64

In [54]:
s[1:3] # [1]부터 [2]까지. ([3] 미포함)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [55]:
s["부산":"대구"] # 부산에서 대구까지(대구도 포함)

도시
부산    3448737
인천    2890451
대구    2446052
Name: 인구, dtype: int64

In [56]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_446_052], # 언더스코어는 끊어읽기 편하려고. 쉼표 역할
              index = ["서울", "부산", "인천", "대구"])
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2446052
Name: 인구, dtype: int64

In [57]:
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [58]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [59]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [60]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [61]:
rs = (s-s2)/s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### series 데이터 추가, 갱신, 삭제
### 기존에 있는 index에 값을 할당하면 갱신 됨. add도 가능

In [62]:
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [64]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [66]:
rs["대구"] = 1.41 # 없는 index에 값을 할당하면 series에 데이터가 추가(add)됨
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [67]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [69]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000} # dict
fin2_value = [60200, 61200, 200100] # fin2_value
fin2_index = ["카카오", "삼성전자", "네이버"] #fin2_index

In [71]:
ser_finance1 = pd.Series(fin1)
ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [73]:
ser_finance2 = pd.Series(data=fin2_value, index=fin2_index)
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [76]:
ser_finance2 = pd.Series(fin2_value, fin2_index)
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [77]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [79]:
ser_finance1+ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [80]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [81]:
ser_finance1/ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [87]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

### dataframe은 pandas의 주요 데이터 구조이다. label된 row와 column, 두개의 축을 갖는 데이터 구조. 산술 연산은 row와 column 모두 적용 됨. series 객체를 갖는 dictionary라고 생각하면 된다. 첫 인자로 data, 두번째 인자로 index 전달

### series가 1차원 벡터 데이터에 row index를 붙인 것이라면 dataframe 클래스는 2차원 행렬 데이터에 index를 붙인 것과 비슷. row index뿐 아니라 각각의 열 데이터의 이름이 되는 column index도 붙일 수 있다.
1. 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비한다.
2. 이 각각의 열에 대한 이름(label)을 키로 가지는 딕셔너리를 만든다.
3. 이 데이터를 dataframe클래스 생성자에 넣는다. 동시에 열방향 index는 columns 인수로, 행방향 index는 index 인수로 지정한다.

In [89]:
d = {'col1':[1, 2], 'col2':[3, 4]} # index는 명시하지 않았기 때문에 자동으로 rangeindex 0부터~
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [165]:
data = {
    "2015":[9904312, 3448737, 2890451, 2466052],
    "2010":[9631482, 3393191, 2632035, 2431774],
    "2005":[9762546, 3512547, 2517680, 2456016],
    "2000":[9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [166]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [167]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [168]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [169]:
df.index.name="도시"
df.columns.name="특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [170]:
data1 = {
    "iPhone 14":[1250000, 1400000, 1700000, "-"],
    "iPhone 14 Plus":[1350000, 1500000, 1800000, "-"],
    "iPhone 14 Pro":[1550000, 1700000, 2000000, 2300000],
    "iPhone 14 Pro Max":[1750000, 1900000, 2200000, 2500000]
}
columns1 = ["iPhone 14", "iPhone 14 Plus", "iPhone 14 Pro", "iPhone 14 Pro Max"]
index1 = ["128GB", "256GB", "512GB", "1TB"]
df1 = pd.DataFrame(data1, index=index1, columns=columns1)
df1

      iPhone 14 iPhone 14 Plus  iPhone 14 Pro  iPhone 14 Pro Max
128GB   1250000        1350000        1550000            1750000
256GB   1400000        1500000        1700000            1900000
512GB   1700000        1800000        2000000            2200000
1TB           -              -        2300000            2500000

In [171]:
df1.T # 행과 열을 바꿈

                     128GB    256GB    512GB      1TB
iPhone 14          1250000  1400000  1700000        -
iPhone 14 Plus     1350000  1500000  1800000        -
iPhone 14 Pro      1550000  1700000  2000000  2300000
iPhone 14 Pro Max  1750000  1900000  2200000  2500000

In [172]:
# df1["1TB"] = df1["1TB"] * 10

In [173]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283          -1.34
부산  경상권  3448737  3393191  3512547  3655437         0.0163          -3.40
인천  수도권  2890451  2632035  2517680  2466338         0.0982           4.54
대구  경상권  2466052  2431774  2456016  2473990         0.0141          -0.99

In [174]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [175]:
# 하나의 cloumn만 인덱싱하면 Series가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [176]:
df["2010"] # series로 가져옴

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [177]:
df[["2010", "2015"]] # dataframe으로 가져옴

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [178]:
df[["2010"]] # dataframe으로 가져옴

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [179]:
type(df[["2010"]])

pandas.core.frame.DataFrame

### dataframe의 colums index가 문자열 label일 때는 순서를 나타내는 정수 index를 column 인덱싱에 사용할 수 없다. column index가 문자열인데 정수 index를 넣으면 KeyError 오류가 발생

In [180]:
df[0]

KeyError: 0

In [ ]:
import numpy as np
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

In [181]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [182]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

### DataFrame row slicing
만약 row 단위로 인덱싱을 하고자 하면 항상 슬라이싱을 해야한다. index 값이 문자 label이면 label 슬라이싱도 가능하다.

In [183]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [184]:
df[:1] # df[:"서울"] --> 문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [185]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [186]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [188]:
df["서울"] #row 단위로 인덱싱 불가. 슬라이싱 해야 함

KeyError: '서울'

In [193]:
df["2015"]["서울"] # dataframe에서 cloumn label로 인덱싱하면 series가 됨.
#이 serires를 다시 row label로 인덱싱하면 개별 데이터가 나옴

9904312

In [190]:
type(df["2015"]["서울"])

numpy.int64

In [195]:
df["서울":"서울"] # dataframe에서 row 단위로는 인덱싱 불가. 슬라이싱. 그떄 반환 타입은 DataFrame

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [196]:
df["서울":"서울"]["2015"]

도시
서울    9904312
Name: 2015, dtype: int64

In [197]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

In [259]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [275]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [279]:
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  80

In [281]:
df["평균 점수"] = round((df["국어"] + df["영어"] + df["수학"])/3, 2)
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [282]:
df["영어"]["방자"] = 80
df["평균 점수"] = round((df["국어"] + df["영어"] + df["수학"])/3, 2)
df

C:\Users\peter\AppData\Local\Temp\ipykernel_17752\2019708904.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [285]:
df["춘향":"춘향"] # df[:1]

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [287]:
df.T["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [316]:
import numpy as np
np.random.seed(0)

rows_1 = [pd.date_range("20130226", periods = 6)]
columns_1 = ["A", "B", "C", "D"]
df_1 = np.random.randn(6, 4)
    
df_1 = pd.DataFrame(df_1, row_1, columns_1)
# df_1 = pd.DataFrame(np.random.randn(6, 5), rows = rows_1, columns = list["ABCD"])
df_1

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

In [321]:
df_1_1 = pd.DataFrame(np.random.randn(6, 4), index = rows_1, columns = list("ABCD"))
df_1_1

                   A         B         C         D
2013-02-26 -0.674333  0.031831 -0.635846  0.676433
2013-02-27  0.576591 -0.208299  0.396007 -1.093062
2013-02-28 -1.491258  0.439392  0.166673  0.635031
2013-03-01  2.383145  0.944479 -0.912822  1.117016
2013-03-02 -1.315907 -0.461585 -0.068242  1.713343
2013-03-03 -0.744755 -0.826439 -0.098453 -0.663478

In [475]:
"""
클래스 속성
count (default 0)
order (default 빈 리스트)

인스턴스 속성
number (필수)
name (default None)

비공개 인스턴스 속성
member (default 빈 set)

메서드
add_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 “000 님은 이미 팀에 있습니다.”를 출력하고 없으면 member에 추가하고 “000 님을 {self.number} 팀에 추가했습니다.” 출력합니다.
rm_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 member 요소에서 삭제하고 “000 님을 {self.number} 팀에서 삭제했습니다.” 출력합니다. 없으면 “000 님은 해당 팀에 없습니다.” 출력하고 메서드를 종료합니다.
get_count(), get_order()는 각각 count와 order의 값을 반환합니다.
set_order()는 숫자를 하나 인자로 받아와서 그 값을 order 맨 뒤에 추가합니다. 이때 이미 값이 있는 경우 앞의 값은 전부 지우고 맨 뒤에 값을 추가합니다.
"""

'\n클래스 속성\ncount (default 0)\norder (default 빈 리스트)\n\n인스턴스 속성\nnumber (필수)\nname (default None)\n\n비공개 인스턴스 속성\nmember (default 빈 set)\n\n메서드\nadd_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 “000 님은 이미 팀에 있습니다.”를 출력하고 없으면 member에 추가하고 “000 님을 {self.number} 팀에 추가했습니다.” 출력합니다.\nrm_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 member 요소에서 삭제하고 “000 님을 {self.number} 팀에서 삭제했습니다.” 출력합니다. 없으면 “000 님은 해당 팀에 없습니다.” 출력하고 메서드를 종료합니다.\nget_count(), get_order()는 각각 count와 order의 값을 반환합니다.\nset_order()는 숫자를 하나 인자로 받아와서 그 값을 order 맨 뒤에 추가합니다. 이때 이미 값이 있는 경우 앞의 값은 전부 지우고 맨 뒤에 값을 추가합니다.\n'

In [597]:
# 선생님의 class
class Team_1:
    """팀 객체를 만듭니다."""
    # 클래스 속성
    count = 0 # Team 클래스로부터 초기화된 인스턴스 개수
    order = []
    
    def __init__(self, number, name = None, member = set()):
        self.number = number
        self.name = name
        self.__member = member
        Team.count += 1
        
    def add_member(self, name):
        # 해당 이름이 팀에 있을 경우
        if name in self.__member:
            print(f"{name}님은 이미 팀에 있습니다.")
            return
        # 해당 이름이 팀에 없을 경우
        else:
            self.__member.add(name)
            print(f"{name}님을 {self.number}팀에 추가했습니다.")
            
    def rm_member(self, name):
        # 해당 이름이 팀에 있을 경우
        if name in self.__member:
            self.__member.discard(name)
            print(f"{name}님을 {self.number}팀에서 삭제했습니다.")
        # 해당 이름이 팀에 없을 경우
        else:
            print(f"{name}님은 해당 팀에 없습니다.")
            return
    
    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self, number):
        if number in self.order:
            self.order.remove(number)
        self.order.append(number)
        
    # 내장 함수(built-in function) len(Team()) --> 파이썬이 __len(self)를 찾아서 실행
    def __len__(self):
        return len(self.__member)

In [577]:
#나의 class
class Team:
    """팀 객체를 만듭니다."""
    # 클래스 속성
    count = 0
    order = []
    
    def __init__(self, number):
        self.number = number
        self.name = None
        self.__member = []
        Team.count += 1
        
    def add_member(self, name):
        if name in self.__member:
            print(f"{name}님은 이미 팀에 있습니다.")
        else:
            self.__member.append(name)
            print(f"{name}님을 {self.number}팀에 추가했습니다.")
            
    def rm_member(self, name):
        if name not in self.__member:
            print(f"{name}님은 해당 팀에 없습니다.")
            return
        else:
            self.__member.remove(name)
            print(f"{name}님을 {self.number}팀에서 삭제했습니다.")
    
    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self, number):
        if number in self.order:
            self.order.remove(number)
        self.order.append(number)
        
    def __len__(self):
        return len(self.__member)

In [578]:
t1 = Team(1) # Team 클래스로부터 인스턴스를 초기화한다. 초기화할 때 넣는 인자 값은 __init__(self, 여기로 전달됨)
# 초기화될 떄 1번 실행되

In [579]:
t1.add_member("김철수")

김철수님을 1팀에 추가했습니다.

In [580]:
t1.add_member("김철수")

김철수님은 이미 팀에 있습니다.

In [581]:
len(t1)

1

In [582]:
t1.add_member("이호진")

이호진님을 1팀에 추가했습니다.

In [583]:
t1.add_member("김영희")

김영희님을 1팀에 추가했습니다.

In [584]:
t1.rm_member("김영희")

김영희님을 1팀에서 삭제했습니다.

In [585]:
t1.rm_member("김영희")

김영희님은 해당 팀에 없습니다.

In [586]:
t2 = Team(2)

In [587]:
t2.set_order(t2.number)

In [588]:
t1.set_order(t1.number)

In [589]:
t1.get_order()

[2, 1]

In [590]:
t1.get_count()

2

In [591]:
t3 = Team(3)

In [592]:
t3.get_count()

3

In [593]:
t3.set_order(t3.number)

In [594]:
t3.get_order()

[2, 1, 3]

In [595]:
t3.set_order(2)

In [596]:
t3.get_order()

[1, 3, 2]